Revit 2024 API
FreeFormElement.CanOffsetFace Method
 Determines if the input face of the FreeFormElement can be offset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool CanOffsetFace(
	Face face
)
Visual Basic
Public Function CanOffsetFace ( _
	face As Face _
) As Boolean
Visual C++
public:
bool CanOffsetFace(
	Face^ face
)
Parameters
face
Type: Autodesk.Revit.DB.Face
 The face to be checked.
Return Value
 True if the face can be offset, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FreeFormElement Class
Autodesk.Revit.DB Namespace